[
    {
        "name": "Présentation",
        "title": true
    },
    {
        "name": "Qui suis-je ?",
        "sections": [
            {
                "name": "Présentation",
                "description": "Bonjour, je m'appelle Victor Vidalot, j'ai 18ans, je fais de la programmation depuis 6 ans, je code en html, css, javascript, reactjs, java (peu utilisé), python, c++ (principalement arduino), C#. Ayant une expérience dans une entreprise de robotique industrielle, je connais également de manière non exhaustive la programmation et le fonctionnement de robot, industriels ou non, et de différentes marques ( kuka, fanuc, doosan, etc.. ), ayant également une expérience dans la programmation en c# de logiciels de supervision de robots dans différentes utilisations et buts",
                "img": ["screenshot.jpg"],
                "screenshot": true
            },
            {
                "name": "Diplômes",
                "description": "Je suis actuellement en DEUST IOSI 2A en alternance, faisant donc coté école des cours théorique et pratique comme par exemple de la programmation en java, en c++, des connaissances basiques en éléctronique, du management, de la mécanique. Coté entreprise ayant aidé a la programmation de robots industriels, dans la réalisation de trajectoires de robots de démo dans divers salons, dans la création de logiciels de supervision de robot dans le cadre de la réalisation de machines industrielles sur-mesures. Dans le cablage éléctrique, et le montage mécanique de ces mêmes machines"
            },
            {
                "name": "Ma vision a cours terme",
                "description": "Ma vision pour mon futur proche serait d'explorer les différents métiers et différents bureaux d'études ou autres dans le but de comprendre et d'enrichir mon expérience, que ce soit dans la réalisation de machine industrielles sur-mesure, de machines spécialisés dans un but expérimental. Continuer a apprendre et découvrir de nouvelles choses variés, de nouvelles technologies et de mettre en pratique plusieurs compétences simultanément tout au long de l'année sont des choses qui me poussent et me motivent a continuer dans cette lancée."
            }
        ]
    },
    {
        "name": "Mes Compétences",
        "title": true
    },
    {
        "name": "Mon Alternance (2023-2025)",
        "sections": [
            {
                "name": "Mécanique",
                "description": "Lors de cette alternance, j'ai participé a la création et le montage de machines mécanique, notament sur le montage mécanique, les déplacement et l'installation de robot dans divers environnements, ainsi que dans du montage mécanique plus traditionelles, notament dans le montage de divers éléments selon des plans préalablement définis."
            },
            {
                "name": "Electricité",
                "description": "J'ai acquis lors de cette alternance des compétences en electricité, dans le cablage d'alimentations, d'armoires electriques, d'entrées/sorties donc de capteurs, le cablage de capteurs de sécurités."
            },
            {
                "name": "Programmation Logicelle",
                "description": "Cette alternance m'a permis d'acquerir le fonctionnement, les méthodes de travail et d'organisation du code dans un milieu professionel, dans le conception de code de manière professionelles."
            },
            {
                "name": "Programmation robot",
                "description": "J'ai plusieurs fois et dans plusieurs buts différents, programmer des trajectoires de robot 6 axes, les 2 sujets principaux étant dans la programmation de trajectoires robot de démo a des fins de présentations dans divers salons, mais également dans la programation de trajectoires dans des machines industrielles diverses."
            },
            {
                "name": "Vision 3D",
                "description": "Dans le cadre de mon alternance, nous avons souvent eue recours a du matériel de vision, dans le but de detecter certain objects, afin par la suite de l'envoyer au robot pour qu'il vienne effectuer une certaines tâche sur cette objet, comme du dévracage par exemple."
            },
            {
                "name": "Programmation web",
                "description": "J'ai a plusieurs reprise eu recours a la programmation web, pour le moment uniquement dans un cadre amateur ou non déployé en production, j'ai cepandant une certaine expérience dans ce domaine, que ce soit coté serveur avec la sécurité des données et des attaques basiques ou du coté frontend, que ce soit en javascript, typescript, react ou autre framework javascript, j'ai également depuis peu des connaissances en flutter et en dart ce qui me permet de developper une application disponible sur plusieurs plateformes, notament android et ios."
            }
        ]
    },
    {
        "name": "Mes créations",
        "title": true
    },
    {
        "name": "Créations Informatiques",
        "sections": [
            {
                "name": "Ideas",
                "description": "Le principe de ce projet est simple, fait en javascript vanillia. Voyez ce projet comme un super-bloc notes, juste de noter des idées clasées dans plusieurs catégories, ici 4 catégories, une idées est composée de deux choses : une todolist afin d'y noter par exemple les etapes de réalisation de notre projet, ainsi qu'une zoen de texte ou l'on peut expliquer ce quel'on a en tête"
            },
            {
                "name": "Projects",
                "description": "Ce projet est en fait la nouvelle version du projet Ideas, simplement que celui-ci est codée en React, plus performant, et surtout correspondant beaucoup plus aux besoins nessesaire a la conception de ce projet. Le but principal résidant dans la création d'un logiciel d'y effectuer l'organisation et la gestion de projet."
            },
            {
                "name": "HOUSEDOMO",
                "description": "Voici mon projet de domotique, le principe est d'avoir une modelisation 3D de ma maison avec des elements 3D interatifs y permettant sont controler par l'intermediaire d'une section qui s'ouvre a la selection de l'element concernée, basée sur un systeme serveur/client, un site web fait en react et nodejs pour le serveur qui communiquera avec un arduino branchée sur la machine sur lequel le 'système du serveur' est installée"
            },
            {       
                "name": "CASE",
                "description": "Voici mon projet actuel, un autre système domotique, mais complètement recrée de zero, cette fois avec une approche profesionelle de par mon expéreince, ce projet est concu de manière a pouvoir contrôler les différents élément de la maison a travers un plan interactif 2D de la maison (bientôt en 3D), concut sur un système serveur/client, un sereur créer en nodejs avec une base de donnée mongodb et une application créer en flutter, ce qui peremt d'avoir un client sur plsuieurs plateformes a la fois, notament sous forme d'application android d'ou ce choix plutot que reactjs avec lequel j'ai plus d'expérience"
            } 
        ]
    }
]